Autodesk.Revit.DB.Document.DocumentClosing
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
Remarks:
This event is raised when Revit is just about to close a document.
This event is cancellable, except when it is raised as part of application closing.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to True to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may not be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk::Revit::ApplicationServices::Application::DocumentClosed event will be raised immediately after document is closed.
Since:
2010

Autodesk.Revit.DB.Document.ViewPrinted
Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
It is raised even when view printing failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.DB.Document.ViewPrinting
Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
Remarks:
This event is raised when Revit is just about to print a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.DB.Document.ViewPrinted will be raised immediately after view printing
is finished.
Since:
2010

Autodesk.Revit.DB.Document.DocumentPrinted
Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view or ViewSet of the document.
It is raised even when document printing failed or was cancelled (during DocumentPriting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.DB.Document.DocumentPrinting
Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
Remarks:
This event is raised when Revit is just about to print a view or ViewSet of the document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
After this event, for each view being printed,Autodesk.Revit.DB.Document.ViewPrinting and Autodesk.Revit.DB.Document.ViewPrinted events will be raised.
Another event Autodesk.Revit.DB.Document.DocumentPrinted will be raised immediately after document printing
is finished.
Since:
2010

Autodesk.Revit.DB.Document.DocumentSavedAs
Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
Remarks:
This event is raised immediately after Revit has finished saving document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavedAs rather than Autodesk.Revit.DB.Document.DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSavingAs event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.DB.Document.DocumentSavingAs
Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
Remarks:
This event is raised when Revit is just about to save the document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavingAs rather than Autodesk.Revit.DB.Document.DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.DB.Document.DocumentSavedAs will be raised immediately after the document has been saved with a new file name.
Since:
2010

Autodesk.Revit.DB.Document.DocumentSaved
Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
Remarks:
This event is raised immediately after Revit has finished saving a document.
Note that the first save of a newly created document  will raise Autodesk.Revit.DB.Document.DocumentSavedAs
rather than the DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSaving event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.DB.Document.DocumentSaving
Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
Remarks:
This event is raised when Revit is just about to save the document.
Note that the first save of a newly created document will raise Autodesk.Revit.DB.Document.DocumentSavingAs
rather than the DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.DB.Document.DocumentSaved will be raised immediately after the document has been saved.
Since:
2010

Autodesk.Revit.DB.Document.GetUnusedThermals
Returns thermals that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these thermals at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The thermals that are not referenced in the document.

Autodesk.Revit.DB.Document.GetUnusedStructures
Returns structures that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these structures at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The structures that are not referenced in the document.

Autodesk.Revit.DB.Document.GetUnusedAppearances
Returns appearances that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these appearances at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The appearances that are not referenced in the document.

Autodesk.Revit.DB.Document.GetUnusedMaterials
Returns materials that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these materials at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The materials that are not referenced in the document.

Autodesk.Revit.DB.Document.GetNumberOfUnusedImportCategories
Returns number of import categories that can be purged from the document.

Autodesk.Revit.DB.Document.GetUnusedImportCategories
Returns import categories that can be purged from the document.
Returns:
Categories that can be purged.

Autodesk.Revit.DB.Document.GetNonDeletableUnusedElements
Returns unused elements that have to be kept in the document if all other unused families and symbols are being deleted.
Returns:
The unused elements that have to be kept in the document.

Autodesk.Revit.DB.Document.GetUnusedLinkSymbols
Returns all link symbols that are not used in the document.
Remarks:
There may be restrictions that prevents deletion of all of these symbols at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The link symbols that are not referenced in the document.

Autodesk.Revit.DB.Document.GetUnusedSymbols
Returns symbols that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these symbols at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The symbols that are not referenced in the document.

Autodesk.Revit.DB.Document.GetUnusedFamilies
Returns families that are not used in the document and potentially can be purged.
Remarks:
There may be restrictions that prevents deletion of all of these families at once.
Utility provides a list of elements that should be excluded from this list if all the others are being deleted.
Returns:
The families that are not referenced in the document.

Autodesk.Revit.DB.Document.RemoveUsedServiceRecord(System.Guid)
Removes the record of a used service.
Remarks:
The intention is to use this in document updates only.
serviceId:
Id of the service the record of which is to be removed.

Autodesk.Revit.DB.Document.SaveLocalSharedModel(System.Guid,System.Guid,System.String)
After execution, document will represent a local model whose central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectGUID:
Identifies the cloud project to which this model will be attached.
assignedModelGUID:
Identifies the model file on the server
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.SaveAsCloudModelInternal(System.String,System.String,System.String,System.String,System.String)
Internal process for previously nonworkshared files.
hubId:
Identifies the hub to which this model will be attached.
projectId:
Identifies the cloud project to which this model will be attached.
projectName:
The project name of this model.
folderId:
The folder ID input from Forge DM
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associate to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Since:
2020

Autodesk.Revit.DB.Document.SaveAsCloudSharedModelCommon(System.Guid,System.String,System.String,System.Boolean)
Common process for both previously workshared and not previously workshared central files.
projectGUID:
Identifies the cloud project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
folderId:
The folder ID input from Forge DM
bCreatedLocal:
If true, this will create a local copy of the model.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associate to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.

Autodesk.Revit.DB.Document.WorkshareCloudModel(System.String)
Enables worksharing for this document. Journal messages match saveAsCloudSharedModel
Remarks:
Assumes that user is currently signed in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.SaveAsWorksharedCloudModel(System.String,System.String)
Saves current model as a cloud workshared model in BIM 360.
Remarks:
Assumes that user is currently signed in to BIM 360 and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
folderId:
Folder identity in BIM 360 to save the model.
modelName:
Model name in BIM 360 to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is cloud model, cannot be saved as cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed due to there is a model in cloud under the project with that name.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Throws Autodesk::Revit::Exceptions::RevitServerUnauthorizedNativeException:
You do not have workshared cloud model entitlement to access this resource in cloud
Throws Autodesk::Revit::Exceptions::UnauthenticatedUserException:
User is not authenticated to access the specified cloud project.
Since:
2018

Autodesk.Revit.DB.Document.IsValidNameForCloudSharedModel(System.Guid,System.String)
Checks whether there is already a model with the specified name attached to the specified A360 project.
projectGUID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
True if there is not already a model with the specified name attached to the specified project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.IsBackgroundCalculationInProgress
Indicates whether there are any background calculations in progress for this document.
Remarks:
When a document has background calculations in progress, users cannot perform the following operations:
Save/Close the document.Export/Print the document.Synchronize to central, in worksharing environment.Create a steel element.Copy/Mirror/Rotate a steel element.Edit the sketch of plate element.Edit a custom connection.
Returns:
Returns true if the document has any data calculation in progress and false otherwise.
Since:
2019.1

Autodesk.Revit.DB.Document.PublishCoordinates(Autodesk.Revit.DB.LinkElementId)
Publish coordinates to the specified ProjectLocation of the link instance.
Remarks:
The host project's True North and shared origin are recorded in the linked project, based on the current position of the linked instance.
This location is now named in both the host project and the linked project. More than one position of the link can be recorded.
When you publish shared coordinates from a host Revit project to a linked DWG, this changes the linked DWG. The origin of the host Revit
project's shared coordinate system becomes the origin of a new User Coordinate System (UCS) in the DWG file. The Y axis of the new UCS corresponds
to the host project's True North. You can name the UCS when you publish coordinates. It is not recommended that you change this name after
publishing coordinates.
Note: Currently, only RevitLinkInstance is supported. DWG link instance, which is
ImportInstance is not supported now. Passing in an locationId that points to an ImportInstance
would result an ArgumentException.
locationId:
The ElementId of the ProjectLocation in the
linked document, to which the transform would be published to.
Throws Autodesk.Revit.Exceptions.ArgumentException:
locationId does not contain a valid linkInstanceId.
-or-
Only RevitLinkInstance is supported through API for publish coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to publish coordinates to the specified ProjectLocation of the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.AcquireCoordinates(Autodesk.Revit.DB.ElementId)
Acquires coordinates from the specified link instance.
Remarks:
When you acquire coordinates from the linked model, the shared coordinates of the linked model become the
shared coordinates of the host model, based on the position of the linked model instance in the host model.
There is no change to the host model's internal coordinates.
The host model also acquires True North from the linked model. The origin of the linked model's shared
coordinates becomes the origin of the host model's shared coordinates.
When a Revit model acquires coordinates from a linked DWG file, the World Coordinate System (WCS) of the
selected linked DWG file becomes the shared coordinate system of the host Revit model, based on the position
of the linked DWG instance. The Y axis of the DWG becomes True North, and the origin of the DWG becomes the
origin of the shared coordinate system of the Revit model.
On acquiring coordinates from a geo-referenced model, the geolocation information will be pulled from the linked
model to the host model.
Unlike UI operation Acquire Coordinates, calling the API would always overwrite the geolocation information in the
host model even if it is different from the one in the linked model, or the linked model has empty geolocation information
(in which case the geolocation information in the host model would be removed).
linkInstanceId:
The ElementId of the link instance (such as
RevitLinkInstance or ImportInstance)
from which the coordinates would be acquired.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element linkInstanceId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The coordinate system of the selected model are the same as the host model.
-or-
Cannot acquire coordinates from a model placed multiple times.
-or-
Failed to acquire coordinates from the link instance.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.Document.GetDocumentVersion(Autodesk.Revit.DB.Document)
Gets the DocumentVersion that corresponds to a document.
Remarks:
This function can be combined with Autodesk.Revit.DB.Document.IsModified
to see whether a document in memory is different from a version on disk. The documents
are different if the document is modified or if the two DocumentVersions differ.
doc:
The document whose DocumentVersion will be returned.
Returns:
The DocumentVersion corresponding to the given document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.Delete(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Deletes a set of elements from the document.
Remarks:
This method will delete the elements and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation.  Pinned elements will be deleted with no warnings.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementIds:
The ids of the elements to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more elements in elementIds do not exist in the document.
-or-
One or more of the elementIds cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.Delete(Autodesk.Revit.DB.ElementId)
Deletes an element from the document given the id of that element.
Remarks:
This method will delete the element and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation.  Pinned elements will be deleted with no warnings.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementId:
Id of the element to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
ElementId cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.RemovePaint(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Remove the material painted on the element's face.
If the face is currently not painted,it will do nothing.
elementId:
The element that the painted face belongs to.
face:
The painted element's face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Document.Paint(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face,Autodesk.Revit.DB.ElementId)
Paint the element's face with specified material.
elementId:
The element that the face belongs to.
face:
The painted element's face.
materialId:
The material to be painted on the face
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The element materialId does not exist in the document
-or-
The face doesn't belong to the element
-or-
The materialId doesn't specify a material element.
-or-
The element's face cannot be painted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.GetPaintedMaterial(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Get the material painted on the element's face. Returns invalidElementId if the face is not painted.
elementId:
The element that the face belongs to.
face:
The painted element's face.
Returns:
The material's Id painted on the element's face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Document.IsPainted(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face)
Checks if the element's face is painted with a material.
elementId:
The element that the face belongs to.
face:
The painted element's face.
Returns:
True if the element's face is painted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
The face doesn't belong to the element
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
This Document is not a workshared document.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.HasAllChangesFromCentral
Returns whether the model in the current session is up to date with central.
Returns:
True means up to date; false means out of date.
If central is locked but Revit can determine that
the model in the current session is out of date
without opening central, this method will return false
instead of throwing CentralModelContentionException.
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a workshared document.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.ReloadLatest(Autodesk.Revit.DB.ReloadLatestOptions)
Fetches changes from central (due to one or more synchronizations with central)
and merges them into the current session.
Remarks:
After this call finishes, use hasAllChangesFromCentral to confirm that there were no
Synchronizations with Central performed during execution of ReloadLatest.
reloadOptions:
Various options to control behavior of reloadLatest.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is not a local model: it is not workshared or is central.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Reload Latest was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.GetSubelement(Autodesk.Revit.DB.ElementId,System.Int32)
Gets the subelement referenced by a parent id and subelement id.
Remarks:
null will be returned if the input id string doesn't reference to a valid element or subelement.
id:
Id of the element.
subId:
Id of the sub element.
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Document.GetSubelement(System.String)
Gets the subelement referenced by a unique id string.
Remarks:
null will be returned if the input id string doesn't reference to a valid element or subelement.
uniqueId:
The unique id that identifies element or subelement.
Autodesk.Revit.DB.Element.UniqueId
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Document.GetSubelement(Autodesk.Revit.DB.Reference)
Gets the subelement referenced by the input reference.
reference:
The reference that identifies element or subelement.
Returns:
The subelement referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference does not identify a valid element or subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Document.GetElement(Autodesk.Revit.DB.ElementId)
Gets the Element referenced by the input ElementId.
Remarks:
null will be returned if the input ElementId doesn't reference to a valid Element.
id:
The ElementId, whose referenced Element will be retrieved from the model.
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Document.GetElement(System.String)
Gets the Element referenced by a unique id string.
Remarks:
null will be returned if the input id string doesn't reference to a valid Element.
uniqueId:
The element unique id, whose referenced Element will be retrieved from the model.
Autodesk.Revit.DB.Element.UniqueId
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Document.GetElement(Autodesk.Revit.DB.Reference)
Gets the Element referenced by the input reference.
Remarks:
null will be returned if the input reference doesn't reference to a valid Element.
reference:
The reference, whose referenced Element will be retrieved from the model.
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Document.MakeTransientElements(Autodesk.Revit.DB.ITransientElementMaker)
This method encapsulates the process of creating transient elements in the document.
Remarks:
The method establishes a context within which transient elements will be created and then invokes the given maker object to create the elements. For more information refer to the Autodesk.Revit.DB.Element.IsTransient method.
maker:
An instance of a class that implements the  Autodesk.Revit.DB.ITransientElementMaker interface.
The maker will be called to create element(s) which would become transient.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document has an open editing transaction and is accepting changes.
-or-
This Document is read-only: It cannot be modified.

Autodesk.Revit.DB.Document.GetDocumentPreviewSettings
Returns the preview settings for the given document.
Returns:
The preview settings.

Autodesk.Revit.DB.Document.IsDefaultFamilyTypeIdValid(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks whether the family type id is valid for the give family category.
familyCategoryId:
The family category id.
familyTypeId:
The default family type id.
Returns:
True if the family type id is valid for the give family category, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.SetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the default family type id for the given family category.
familyCategoryId:
The family category id.
familyTypeId:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The family type id familyTypeId is invalid for the give family category familyCategoryId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.GetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId)
Gets the default family type id with the given family category id.
familyCategoryId:
The family category id.
Returns:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.IsDefaultElementTypeIdValid(Autodesk.Revit.DB.ElementTypeGroup,Autodesk.Revit.DB.ElementId)
Checks whether the element type id is valid for the give DefaultElmentType id.
defaultTypeId:
The default element type id.
typeId:
The element type id.
Returns:
True if the element type id is valid for the give DefaultElmentType id, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Document.SetDefaultElementTypeId(Autodesk.Revit.DB.ElementTypeGroup,Autodesk.Revit.DB.ElementId)
Sets the default element type id of the given DefaultElementType id.
defaultTypeId:
The default element type id.
typeId:
The element type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element type id typeId is invalid for the give DefaultElementType id defaultTypeId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Document.GetDefaultElementTypeId(Autodesk.Revit.DB.ElementTypeGroup)
Gets the default element type id with the given DefaultElementType id.
defaultTypeId:
The default element type id.
Returns:
The element type id.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Document.GetCloudModelPath
Gets the cloud model path of the cloud model.
Returns:
The cloud model path
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is cloud model, cannot be saved as cloud model.
Since:
2019.1

Autodesk.Revit.DB.Document.GetWorksharingCentralModelPath
Gets the central model path of the worksharing model.
Returns:
The central model path, or null if the document is not workshared.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a workshared document.
Since:
2013

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()).
If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail.
If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model.
If the EnergyDataSettings is set to use conceptual models, this function cannot be used. Instead use Autodesk::Revit::DB::Document::Export(String, String, MassGBXMLExportOptions).
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
-or-
Analysis type is invalid. For AnalysisMode.ConceptualMasses, use Document.Export(String, String, MassGBXMLExportOptions).
-or-
There is no main EnergyAnalysisDetailModel in the document, or the current main EnergyAnalysisDetailModel is not compatible with the option set in the GBXMLExportOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions)
Exports a gbXML file from a mass model document.
Remarks:
This is only available for projects containing one or more instances of Conceptual Mass families.
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
-or-
options object is invalid: There should be at least one Id in MassZoneIds, the MassIds should be for masses without mass floors.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
The weather station name is not valid for exporting gbXML files.
-or-
Cannot export gbXML files, because the energy model setting is off.
-or-
Failed to export gbxml files due to internal errors.

Autodesk.Revit.DB.Document.GetWarnings
Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document.
Remarks:
Function returns list of failure messages identical to the list displayed in a warning dialog when command
Manage tab->Inquiry pane->Review Warnings is issued through the UI. Operations performed on the returned list by the caller
do not impact information about warnings stored in the document.
Returns:
List of failure messages representing warnings accumulated in the document.
Since:
2018

Autodesk.Revit.DB.Document.PostFailure(Autodesk.Revit.DB.FailureMessage)
Posts a failure to be displayed to the user at the end of transaction.
Remarks:
If code inside transaction detects a problem that needs to be communicated to the user,
it should report these conditions via this method. Failures will be validated and possibly
resolved at the end of transaction.
Warnings posted via this method will not be stored in the document after they are resolved.
A unique key returned by postFailure can be stored for the lifetime of transaction and used to
remove failure message if it is no longer relevant.
failure:
The failure to be posted.
Returns:
A unique key that identifies posted failure message in a document. If exactly the same error is posted more than once,
and not removed between the postings, returned key will be the same every time.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Document must be in state of accepting posted failures and the failures must be appropriate
for that current state.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.Document.UnpostFailure(Autodesk.Revit.DB.FailureMessageKey)
Deletes the posted failure message associated with a given FailureMessageKey.
Remarks:
If code that previously has posted a failure is executed again or otherwise detects
that failure conditions do not exist anymore and the failure is not longer relevant,
it should delete a failure message in order to let transaction to be committed.
In order to delete the failure, it should invoke this method with a message key
that was returned when the failure was posted.
messageKey:
The key of the FailureMessage to be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentException:
messageKey is invalid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2011

Autodesk.Revit.DB.Document.SaveToProjectAsImage(Autodesk.Revit.DB.ImageExportOptions)
Creates an image view from the currently active view.
options:
The options which govern the image creation.
Returns:
Id of the newly created view if the operation succeeded, invalid element id otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options object is invalid: the ExportRange is invalid, must be CurrentView or VisibleRegionOfCurrentView, or the ViewName is invalid, must be non-empty, unique and should not contain prohibited characters.
-or-
The current view cannot be exported as an image
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWFImportOptions)
Links Markups in a DWF file to the document.
file:
Full path of the file to link. File must exist and must be a valid DWF file.
options:
Various link options applicable to the DWF format.
Returns:
A collection of link instance element ids created by the markup link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWF import (.dwf or.dwfx files are valid).
-or-
Some of the views is not importable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DGN file to the document.
file:
Full path of the file to link. File must exist and must be a valid DGN file.
options:
Various import options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters
-or-
Visible layer only option must be set to false for DGN import
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DGN file to the document.
file:
Full path of the file to import. File must exist and must be a valid DGN file.
options:
Various options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be imported.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters
-or-
Visible layer only option must be set to false for DGN import
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Links an SKP file into the document.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Imports an SKP file into the document.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Links an SAT file into the document.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Imports an SAT file into the document.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat file is valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DWG or DXF file to the document.
file:
Full path of the file to link. File must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file will be linked.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The array of line weights is not valid; either it contains less than expected 255 values, or one or more values are out of range 1 to 16
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DWG or DXF file to the document.
file:
Full path of the file to import. File must exist and must be a valid DWG or DXF file.
options:
Various options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
The view into which the file wil be imported.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The array of line weights is not valid; either it contains less than expected 255 values, or one or more values are out of range 1 to 16
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.NavisworksExportOptions)
Exports a Revit project to the Navisworks .nwc format.
Remarks:
This is an optional functionality that does not have to be installed. The method "OptionalFunctionalityUtils.isNavisworksExporterAvailable()" can be called to check if the exporter is present.
folder:
The name of the folder for the exported file.
name:
The name of the exported file.  If it doesn't end in '.nwc', this extension will be added automatically.
options:
Options which control the contents of the export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
The input options were not valid. Check the exception message for specific details.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
The export operation is cancelled in event handler.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
A Navisworks Exporter is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.IFCExportOptions)
Exports the document to the Industry Standard Classes (IFC) format.
Remarks:
Exporting to IFC requires that document is modifiable, therefore there must be a transaction already open when this method is called.
This method may not be invoked during dynamic update, for the internal routine might need to modify the existing transaction.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
options:
Various options applicable to the IFC format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The IFCExportOptions FamilyMappingFile does not exist.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The IFC module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.SATExportOptions)
Exports the current view or a selection of views in SAT format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the SAT format.For now, this option is empty.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The SAT module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DGNExportOptions)
Exports a selection of views in DGN format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DGN format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
Thrown when the options in DGNExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DXFExportOptions)
Exports a selection of views in DXF format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DXF format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DXF module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.DWGExportOptions)
Exports a selection of views in DWG format.
Remarks:
All the views must be printable for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
If null, throw ArgumentException.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the DWG format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
-or-
non empty list of views must be provided
-or-
some of the views is not printable(exportable)
-or-
The modifiers set in layer info must be valid.
-or-
Thrown when the options in DWGExportOptions is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The DWG module is not available in the installed Revit.
-or-
The Graphics module is not available in the installed Revit.

Autodesk.Revit.DB.Document.ExportImage(Autodesk.Revit.DB.ImageExportOptions)
Exports a view or set of views into an image file.
options:
The options which govern the image export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current view cannot be exported as an image
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The path indicated could not be accessed.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The path indicated could not be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Exporting is not allowed in the current application mode.
-or-
Failed to export image due to an error with the inputs.
-or-
Failed to export image due to an issue where the DirectX Device was lost.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Graphics module is not available in the installed Revit.
Since:
2011

Autodesk.Revit.DB.Document.EnableCloudWorksharing
Enables cloud worksharing for a cloud model
Remarks:
This operation will convert an existing cloud model to a workshared cloud model.
This method cannot be used if current model is not a cloud model.
This method cannot be used if the current user doesn't have the workshared cloud model entitlement.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the cloud model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The model in cloud is missing.
-or-
The model in cloud is incompatible.
-or-
The model in cloud is corrupt or not an RVT file.
-or-
The model in cloud was rolled back.
-or-
An internal error happened on the model in cloud , please contact the administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local cache.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
The cloud model does not allow cloud worksharing to be enabled.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that conversion fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Throws Autodesk::Revit::Exceptions::RevitServerUnauthorizedNativeException:
You do not have workshared cloud model entitlement to access this resource in cloud
Throws Autodesk::Revit::Exceptions::UnauthenticatedUserException:
User is not authenticated to access the specified cloud project
Since:
2019.2

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.String,System.String)
Saves current nonworkshared model as a cloud model in BIM 360.
Remarks:
Assumes that user is currently signed in BIM 360 and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
folderId:
Folder identity in BIM 360 to save the model.
modelName:
Model name in BIM 360 to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
-or-
modelName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document is a workshared document.
-or-
Saving is not allowed in the current application mode.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is cloud model, cannot be saved as cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed due to there is a model in cloud under the project with that name.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Throws Autodesk::Revit::Exceptions::RevitServerUnauthorizedNativeException:
You do not have cloud model entitlement to access this resource in cloud
Throws Autodesk::Revit::Exceptions::UnauthenticatedUserException:
User is not authenticated to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.SaveCloudModel
Saves cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Could be for any of the reasons that related to access to the cloud model.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that fails with CentralModelException, for example, a central model with that name
is already associated to the specified cloud project.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
The file is read-only, can not be saved.
-or-
This Document is cloud model, cannot be saved as cloud model.
-or-
This Document is a workshared document.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that save fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud project.
Since:
2019.2

Autodesk.Revit.DB.Document.SaveAs(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.SaveAsOptions)
Saves the document to a given path.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
If options.rename is true, then the document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
path:
Name and path to be saved as. For a file path, either a relative or absolute path can be provided.
options:
Options to govern the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is empty.
-or-
The specified filepath is invalid.
-or-
options.PreviewViewId is not valid for generation of a preview.
-or-
The document is not workshared,
so no WorksharingSaveAsOptions are allowed to be set for SaveAs.
-or-
The document just had worksharing enabled or was opened detached,
so WorksharingSaveAsOptions.SaveAsCentral must be set to true for SaveAs.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is being accessed by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is overwritten by other user.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model. Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Overwrite old-version model is not supported for server-based.
-or-
An internal error happened on the central model, please contact the server administrator.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed. Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
options.overwriteExistingFile is 'false' but there is an existing file at path.
-or-
options.overwriteExistingFile is 'true' but the target file at path is read only.
-or-
There is already a central at path; Revit Server does not allow overwrite.
-or-
Revit Server only supports RVT model.
-or-
Saving is not allowed in the current application mode.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
-or-
The file path is invalid.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Since:
2014

Autodesk.Revit.DB.Document.SaveAs(System.String,Autodesk.Revit.DB.SaveAsOptions)
Saves the document to a given file path.
Remarks:
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
If options.rename is true, then the document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
filepath:
File name and path to be saved as. Either a relative or absolute path can be provided.
options:
Options to govern the SaveAs operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
filepath is an empty string.
-or-
The specified filepath is invalid.
-or-
options.PreviewViewId is not valid for generation of a preview.
-or-
The document is not workshared,
so no WorksharingSaveAsOptions are allowed to be set for SaveAs.
-or-
The document just had worksharing enabled or was opened detached,
so WorksharingSaveAsOptions.SaveAsCentral must be set to true for SaveAs.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
options.overwriteExistingFile is 'false' but there is an existing file at filepath.
-or-
options.overwriteExistingFile is 'true' but the target file at filepath is read only.
-or-
Saving is not allowed in the current application mode.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Revit cannot clear the transmitted flag. This is not a transmitted document.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.SaveAs(System.String)
Saves the document to a given file path.
Remarks:
The document's title in Revit's title bar
will be updated automatically to reflect the file's new name.
filepath:
File name and path to be saved as. Either a relative or absolute path can be provided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
filepath is an empty string.
-or-
The filepath is not a valid file path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The file at the given path location could not be accessed or saved.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The given file, path or network location could not be found during save.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
There is an existing file at filepath.
-or-
Saving is not allowed in the current application mode.
-or-
The document just had worksharing enabled or was opened detached,
so SaveAsOptions must be passed in SaveAs
with WorksharingSaveAsOptions.SaveAsCentral set to true.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.Save(Autodesk.Revit.DB.SaveOptions)
Saves the document.
Remarks:
If the document was created in this current session and has not been saved to a file yet,
it needs to be first saved using the SaveAs method instead.
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
options:
Options to control the Save operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
options.PreviewViewId is not valid for generation of a preview.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Save may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
Save is temporarily disabled.
-or-
Saving is not allowed in the current application mode.
-or-
File path must be already set to be able to save the document.It needs to be first saved using the SaveAs method instead.
-or-
The file is read-only, can not be saved.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.Save
Saves the document.
Remarks:
If the document was created in this current session and has not been saved to a file yet,
it needs to be first saved using the SaveAs method instead.
This method may not be called unless all transactions, sub-transactions, and transaction groups
that were opened by the API code were closed.
That also implies that this method cannot be called during dynamic updates.
Event handlers are not allowed to save document that are currently in modifiable state.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Central model is missing.
-or-
Central model is incompatible.
-or-
The central model was saved in a different version of Revit.
-or-
Revit encountered errors while saving to the new central model.  Resave again as a new central model.
-or-
Incompatible servers for external services.
-or-
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Save may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to save the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
Save is temporarily disabled.
-or-
Saving is not allowed in the current application mode.
-or-
File path must be already set to be able to save the document.It needs to be first saved using the SaveAs method instead.
-or-
The file is read-only, can not be saved.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
-or-
Saving failed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Saving was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.OutdatedDirectlyOpenedCentralException:
Other users have modified the central model while you had it opened. Resave your document as a local file and then synchronize with central again.
Since:
2014

Autodesk.Revit.DB.Document.GetWorksetId(Autodesk.Revit.DB.ElementId)
Get Id of the Workset which owns the element.
Remarks:
Each element belongs to one and only one workset.
id:
Id of the element.
Returns:
Id of the Workset which owns the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String)
Enables worksharing in the document.
Remarks:
The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
worksetNameGridLevel:
Name of workset for grids and levels.
worksetName:
Name of workset for all other elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
worksetNameGridLevel is an empty string.
-or-
worksetName is an empty string.
-or-
worksetNameGridLevel cannot include prohibited characters.
-or-
worksetName cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document does not allow worksharing to be enabled.
-or-
This Document has is in an edit mode or is in family mode.
-or-
This Document is a workshared document.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Enabling worksharing was cancelled.
Since:
2014

Autodesk.Revit.DB.Document.CanEnableWorksharing
Checks if worksharing can be enabled in the document.
Returns:
True if worksharing can be enabled in the document, False otherwise.
Since:
2015

Autodesk.Revit.DB.Document.CanEnableCloudWorksharing
Checks if cloud worksharing can be enabled for the cloud model.
Returns:
True if cloud worksharing can be enabled in the document, which also means the current document is a single user cloud model, False otherwise.
Since:
2019.2

Autodesk.Revit.DB.Document.SetUnits(Autodesk.Revit.DB.Units)
Sets the units.
units:
The units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Document.GetUnits
Gets the Units object.
Returns:
The Units object.
Since:
2014

Autodesk.Revit.DB.Document.GetWorksetTable
Get the WorksetTable of this document.
Remarks:
There is one WorksetTable for each document.
There will be at least one workset in the table, even if sharing has not yet been enabled for this document.
Returns:
The WorksetTable of this document.

Autodesk.Revit.DB.Document.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Document.MassDisplayTemporaryOverride
This setting controls temporary display in views of objects with mass category or subcategories.
Remarks:
This setting is temporary and is not stored in the document.
The mass display overrides allow mass category and certain mass subcategories
to be displayed in all views, regardless of the visibility settings of that view.
The settings that show certain mass subcategories will also force the other mass
subcategories to be hidden.
The MassDisplayTemporaryOverrideType that is active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The MassDisplayTemporaryOverrideType::Enum value is not in the proper range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Document.WorksharingProjectGUID
The central GUID of the A360 project to which the central model is associated.
Remarks:
This is only valid if the central model is cloud-based.
Since:
2015

Autodesk.Revit.DB.Document.CloudModelGUID
The GUID of the cloud model.
Remarks:
This is only valid if the model is cloud-based.
Since:
2019.1

Autodesk.Revit.DB.Document.WorksharingCentralGUID
The central GUID of the server-based model.
Remarks:
The central model of this document that is file-based model or saved in a release prior to Revit 2013 did not have this GUID.
Only the central model saved in Revit 2013 or later and stored on Revit Server will be able to provide this value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the central model of this document is not a server-based model that created in Revit 2013 or later release.
Since:
2013

Autodesk.Revit.DB.Document.IsModelInCloud
Identifies if document is stored on Autodesk cloud services.
Since:
2019.1

Autodesk.Revit.DB.Document.IsDetached
Identifies if a workshared document is detached.
Also, see Autodesk.Revit.DB.Document.IsWorkshared
Remarks:
Note that Autodesk.Revit.DB.Document.Title and Autodesk.Revit.DB.Document.PathName will be empty strings if a document is detached.
Since:
2015

Autodesk.Revit.DB.Document.IsCentralModel
Identifies whether this is a central model.

Autodesk.Revit.DB.Document.IsLocalModel
Identifies whether this is a local model.

Autodesk.Revit.DB.Document.IsWorkshared
Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document.
Also, see Autodesk.Revit.DB.Document.IsDetached

Autodesk.Revit.DB.Document.IsLinked
Identifies if a document is a linked RVT.
Since:
2014

Autodesk.Revit.DB.Document.IsReadOnlyFile
Signals whether the document was opened from a read-only file.
Remarks:
A document could be opened this way when, for example, at the time of opening
the file was being used by another Revit user, or if the disk file has the read-only attribute set.
Although it will still be possible to modify the opened document,
any changes made there will not be possible to save into the original file.
If the changes are to be preserved, the document must be saved under a different
name using the SaveAs() method.

Autodesk.Revit.DB.Document.IsReadOnly
Identifies if the document is read-only or can possibly be modified.
Remarks:
Like the Autodesk.Revit.DB.Document.IsModifiable, IsReadOnly is also a dynamic property.
It's value can change depending on the state a document is currently in.
There are various factors that may affect this property.
The most probable reason for this property to return 'true' is when Revit is currently processing failures (recoverable or not).
Another possibility is when an external command is executed in read-only mode.
If a document is in a read-only state, then not only the model cannot be modified at the moment, but even a new transaction may not be started.
Attempting to do so will raise an InvalidOperationException.

Autodesk.Revit.DB.Document.IsModified
The state of changes made to the document.

Autodesk.Revit.DB.Document.IsModifiable
The document's state of modifiability.
Remarks:
This is not a permanent state such as, for example Autodesk.Revit.DB.Document.IsReadOnlyFile.
Value of this property changes dynamically multiple times within the life-time of an open document.
Regardless of the mode a document is opened with, the model can only be modified inside an open transaction.
Furthermore, even with a transaction open, the model is not always modifiable.
Though this is rather a rare situation, it can happen, most likely during model regeneration, failure processing, or some events.
An attempt to modify a non-modifiable document will result in throwing a ModificationOutsideTransactionException.
See also Autodesk.Revit.DB.Document.IsReadOnly

Autodesk.Revit.DB.Document.Title
The document's title.
Remarks:
Title is derived from the document's filename. Extension will be present, depending on user settings
Note that returned title will be defaulted if no document saved.
Note that returned string may be empty if a document is detached.  See Autodesk.Revit.DB.Document.IsDetached.

Autodesk.Revit.DB.Document.PathName
The fully qualified path of the document's disk file.
Remarks:
This string is empty if the project has not been saved
or does not have a disk file associated with it yet.
Note that the pathname will be empty if a document is detached.  See Autodesk.Revit.DB.Document.IsDetached.

Autodesk.Revit.DB.Document.ProjectId
Project id where the model locates. For legacy C4R model in BIM360 Team, it will be A360 project id, otherwise it will be ForgeDM project id.

Autodesk.Revit.DB.Document.HubId
Hub id where the model locates. For legacy C4R model in BIM360 Team, it will be A360 hub id, otherwise it will be ForgeDM hub id.

Autodesk.Revit.DB.Document.CentralModelUrn
An WIP DM urn identifying the model.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.DWFXExportOptions,System.Collections.Generic.IList{System.String}@)
Exports the current view or a selection of views in DWFX format.
folder: Output folder, into which file(s) will be exported. The folder must exist.
name: Either the name of a single file or a prefix for a set of files.
If null or empty, automatic naming will be used.
views: Selection of views to be exported.
options: Various options applicable to the DWFX format.
If null, all options will be set to their respective default values.
uniqueIds: Output elements' unique ids container, all these elements which can be seen in views would be exported.
Returns: Function returns true only if all specified views are exported successfully.
The function returns False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input views is an empty ViewSet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not modifiable.
Remarks: All the views must be printable in order for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.

Autodesk.Revit.DB.Document.Paint(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Face,Autodesk.Revit.DB.FamilyParameter)
Paint the element's face with specified material.
elementId:
The element that the face belongs to.
face:
The painted element's face.
familyParameter:
The family parameter associated with a material.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document.
-or-
The element materialId does not exist in the document.
-or-
The face doesn't belongs to the element.
-or-
The family parameter doesn't specify a material element.
-or-
The element's face cannot be painted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This document is not modifiable.
-or-
This operation is valid only in family.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Document.AutoJoinElements
Forces the elements in the Revit document to automatically join to their neighbors where appropriate.
Throws Autodesk.Revit.Exceptions.AutoJoinFailedException:
Thrown when the operation fails.
Remarks: Use this method to force elements in the document to automatically join to their neighbors. Note that when a transaction
is committed there is an automatic call to automatically join elements.

Autodesk.Revit.DB.Document.Regenerate
Updates the elements in the Revit document to reflect all changes.
Throws Autodesk.Revit.Exceptions.RegenerationFailedException:
Thrown when the operation fails.
If regeneration fails, there is posted error of severity DocumentCorruption that will be delivered to the end user
at the end of transaction explaining what specifically has happened. If regeneration has failed, document is corrupted and even reading from it is illegal.Code that called regeneration and got this exception should not catch and ignore it - instead, it should do nothing
but internal cleanup and return control to the owner of currently active transaction/subtransaction, which must be aborted.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Modification of the document is forbidden.  Typically,
this is because there is no open transaction;  consult documentation for Document.IsModified for other possible causes.
Remarks: Use this method to force update to the document after a group of changes. Note that when a transaction is committed
there is an automatic call to regenerate the document.

Autodesk.Revit.DB.Document.ConvertSymbolicToModelCurves(Autodesk.Revit.DB.View,Autodesk.Revit.DB.SymbolicCurveArray)
Converts a group of SymbolicCurves to equivalent ModelCurves.
view: The view where the new lines will be created.
The lines are projected on the view workplane.
The view workplane must be parallel to the view plane.
symbolicCurve:  The symbolic curve array to be converted.
Throws System.ArgumentNullException:
Thrown when the input argument is null.
Throws System.InvalidOperationException:
Thrown when one or more curves could not be successfully converted.
Remarks: This operation will create new ModelCurves with the symbolicCurves' geometry curves and delete the SymbolicCurve in the array.

Autodesk.Revit.DB.Document.ConvertModelToSymbolicCurves(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ModelCurveArray)
Converts a group of ModelCurves to equivalent SymbolicCurves.
view: The view where the new lines will be created.
The lines are projected on the view workplane.
The view workplane must be parallel to the view plane.
If the lines are not parallel to the view plane, lines are foreshortened and arcs are converted to ellipses.
Splines are modified.
modelCurves:  The model curve array to be converted.
Throws System.ArgumentNullException:
Thrown when the input argument is null.
Throws System.ArgumentException:
Thrown when view is invalid to create SymbolicCurves on it.
Throws System.InvalidOperationException:
Thrown when current document is a family.
Thrown when one or more curves could not be successfully converted, perhaps because some of the input curves could not be projected onto the active workplane of the view.
Remarks: This operation will create new SymbolicCurves with the modelCurves' geometry curves and delete the ModelCurve in the array.
If modelCurves are not parallel to the workplane, they will be projected to the workplane and create new SymbolicCurves with the projected curves.

Autodesk.Revit.DB.Document.ConvertDetailToModelCurves(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DetailCurveArray)
Converts a group of DetailCurves to equivalent ModelCurves.
view: The view where the new lines will be created.
The lines are projected on the view workplane.
The view workplane must be parallel to the view plane.
detailCurves:  The detail curve array to be converted.
Throws System.ArgumentNullException:
Thrown when the input argument is null.
Throws System.ArgumentException:
Thrown when the given detail lines are not visible in the given view.
Thrown when the detail lines are not in the same view or not parallel to the given view.
Throws System.InvalidOperationException:
Thrown when one or more curves could not be successfully converted.
Remarks: This operation will create new ModelCurves with the same geometry of the original detail curves' geometry. The detail curves will be deleted from the document.

Autodesk.Revit.DB.Document.ConvertModelToDetailCurves(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ModelCurveArray)
Converts a group of ModelCurves to equivalent DetailCurves.
view: The view where the new lines will be created.
The lines are projected on the view plane.
If the lines are not parallel to the view plane, lines are foreshortened and arcs are converted to ellipses.
Splines are modified.
modelCurves:  The model curve array to be converted.
Throws System.ArgumentNullException:
Thrown when the input argument is null.
Throws System.ArgumentException:
Thrown when view is invalid to create DetailCurves on it.
Throws System.InvalidOperationException:
Thrown when current document is a family.
Thrown when one or more curves could not be successfully converted, perhaps because some of the input curves could not be projected onto the active workplane of the view.
Remarks: This operation will create new DetailCurves with the same geometry of the original model curves' geometry. The model curves will be deleted from the document.
If the model curves do not lie in a plane parallel to the view, their geometry will be projected to the view.

Autodesk.Revit.DB.Document.Application
Returns the Application in which the Document resides.

Autodesk.Revit.DB.Document.SeparateElements(Autodesk.Revit.DB.CombinableElementArray)
Separate a set of combinable elements out of combinations they currently belong to.
members: A list of combinable elements to be separated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when members is empty.
Thrown when members contains null elements.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when separation failed.
Remarks: If geometry combination elements are passed as input, they will be completely separated and deleted.
If generic forms that happen to belong to combination elements are passed, these forms will be removed from
their geometry combination. The handles of geometry combinations completely removed by this operation are no longer valid.

Autodesk.Revit.DB.Document.CombineElements(Autodesk.Revit.DB.CombinableElementArray)
Combine a set of combinable elements into a geometry combination.
members: A list of combinable elements to be combined.
Returns: If successful, the newly created geometry combination is returned, otherwise an
exception with error information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when members contains less than two elements.
Thrown when members contains null elements.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when creation of the combination failed.
Remarks: If one or more existing geometry combinations are included as input, the return value may be one of those pre-existing
combinations. The rest of the pre-existing geometry combinations will be consumed into the new combination; those handles are no longer valid.

Autodesk.Revit.DB.Document.OwnerFamily
Get the Family of this Family Document.
The owner family of this document.
Remarks:  Only available if the current document is family document.

Autodesk.Revit.DB.Document.IsFamilyDocument
Identifies if the current document is a family document.

Autodesk.Revit.DB.Document.GetSpaceAtPoint(Autodesk.Revit.DB.XYZ)
Gets a space containing the point.
point: Point to be checked.
Returns: The space containing the point.
Remarks: Surveys only the spaces from the final phase of the project. The first one found will be returned. If there is no space containing the point, it returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.

Autodesk.Revit.DB.Document.GetSpaceAtPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Phase)
Gets a space containing the point.
Gets a space containing the point.
point: Point to be checked.
phase: Phase in which the space exists.
Returns: The space containing the point.
Remarks: If phase is null, it will get the space of the last phase.The first one found will be returned. If there is no space containing the point, it returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.

Autodesk.Revit.DB.Document.GetRoomAtPoint(Autodesk.Revit.DB.XYZ)
Gets a room containing the point.
point: Point to be checked.
Returns: The room containing the point.
Remarks: Surveys only the rooms from the final phase of the project. The first one found will be returned. If there is no room containing the point, it returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.

Autodesk.Revit.DB.Document.GetRoomAtPoint(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Phase)
Gets a room containing the point.
Gets a room containing the point.
point: Point to be checked.
phase: Phase in which the room exists.
Returns: The room containing the point.
Remarks: If phase is null, it will get the room of the last phase.The first one found will be returned. If there is no room containing the point, it returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the point is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.

Autodesk.Revit.DB.Document.GetPrintSettingIds
Retrieves all Print Settings of current project.
Returns: The ElementIds of all print setting elements

Autodesk.Revit.DB.Document.PrintManager
Retrieve the PrintManager of current project.

Autodesk.Revit.DB.Document.SiteLocation
Returns the site location information.
Remarks: The SiteLocation property returns an object that contains the site location
for the entire project.

Autodesk.Revit.DB.Document.ActiveProjectLocation
Retrieve the active project location.
Remarks: Getting this property returns the currently active project location that
the user is currently working with. Setting this property can be used to change
the active project location.

Autodesk.Revit.DB.Document.ProjectLocations
Retrieve all the project locations associated with this project
Remarks: This property returns all the locations of the project. A project can have one
site location but many project locations within that site. Each project location object
is an offset and rotation from the site location.

Autodesk.Revit.DB.Document.ActiveView
The document's active view.
The active view is the view that last had focus in the UI.
null if no view is considered active.

Autodesk.Revit.DB.Document.FamilyManager
The family manager object provides access to family types and parameters.
Remarks: This property is available when the document is a family document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is project document.

Autodesk.Revit.DB.Document.FamilyCreate
An object that can be used to create new instances of Autodesk Revit API elements
within a family document.
This object is used to create new instances of family
elements within the Autodesk Revit API, such as Extrusion or Reference lines.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is project document.

Autodesk.Revit.DB.Document.Create
An object that can be used to create new instances of Autodesk Revit API elements
within a project.
This object is used to create new instances of project
elements within the Autodesk Revit API, such as FamilyInstances or groups.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is family document.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.GBXMLImportOptions)
Imports a Green-Building XML file into the document.
file: Full path of the file to import. File must exist.
options: Various options applicable to GBXml import. If null, all options will be set to their respective default values.
Remarks: This method is available only in MEP.
Though the 'options' argument is not currently used, an object still must be provided (may be null).
The method will return False if not succeed. e.g when the input xml file does not contain any result elements.
Returns: True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when file argument is null or empty.
Throws Autodesk.Revit.Exceptions.FileNotFoundException: Thrown when the file specified does not exist.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when no file is specified or if the file is not a valid gbXML file or does not contain any result elements.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ImageImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element@)
Imports an image (a bitmap) into the document.
file: Full path of the file to import. File must exist.
options: Various options applicable to an image.
If null, all options will be set to their respective default values.
view: The view into which the image is going to be imported.
element: The imported instance after a successful import.
It could be used for further manipulating of that instance.
Returns: True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown if view is null.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.FBXExportOptions)
Exports the document in 3D-Studio Max (FBX) format.
folder: Output folder, into which file(s) will be exported. The folder must exist.
name: Either the name of a single file or a prefix for a set of files.
If null or empty, automatic naming will be used.
views: Selection of views to be exported.Only 3D views are allowed.
options: Options applicable to the FBX format.
Remarks: Though the 'options' argument is not currently used,
an object still must be provided (may be null).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input views is an empty ViewSet.
Thrown if  any view in the views is not a 3D view.
Returns: Function returns true only if all specified views are exported successfully.
The function returns False if exporting of any view fails, even if some views might have been exported successfully.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.DWFXExportOptions)
Exports the current view or a selection of views in DWFX format.
folder: Output folder, into which file(s) will be exported. The folder must exist.
name: Either the name of a single file or a prefix for a set of files.
If null or empty, automatic naming will be used.
views: Selection of views to be exported.
options: Various options applicable to the DWFX format.
If null, all options will be set to their respective default values.
Returns: Function returns true only if all specified views are exported successfully.
The function returns False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input views is an empty ViewSet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not modifiable.
Remarks: All the views must be printable in order for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.DWFExportOptions)
Exports the current view or a selection of views in DWF format.
folder: Output folder, into which file(s) will be exported. The folder must exist.
name: Either the name of a single file or a prefix for a set of files.
If null or empty, automatic naming will be used.
views: Selection of views to be exported.
options: Various options applicable to the DWF format.
If null, all options will be set to their respective default values.
Returns: Function returns true only if all specified views are exported successfully. Returns False if exporting of any view fails,
even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input views is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input views is an empty ViewSet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not modifiable.
Remarks: All the views must be printable in order for the Export to succeed.
It can be assured by checking the CanBePrinted property of each view.

Autodesk.Revit.DB.Document.Close
Closes the document, save the changes if there are.
Returns: False if either closing procedure fails or if saving of a modified document failed.
Also returns False if closing is cancelled by an external application during 'DocumentClosing' event.
When function succeeds, True is returned.
Remarks: The currently active document may not be closed by this function. It can only be closed via Revit's UI.
The changes will saved automatically, the document will not be closed if failed to save changes.
If the document was created in this current session and has not been saved to a file yet, it needs to call Revit::UI::UIDocument::SaveAndClose() method instead.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to close the currently active document.
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Thrown if the PathName is not set yet.
Thrown if the saving target file is read only.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this a linked file.

Autodesk.Revit.DB.Document.Close(System.Boolean)
Closes the document.
Closes the document with the option to save.
saveModified: Indicates if the current document should be saved before close operation.
Returns: False if closing procedure fails or if saving of a modified document was requested (saveModified = True) but failed.
Also returns False if closing is cancelled by an external application during 'DocumentClosing' event.
When function succeeds, True is returned.
Remarks: The currently active document may not be closed by this function. It can only be closed via Revit's UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when attempting to close the currently active document.
Thrown if there are any transactions, sub-transactions or transaction groups which
were opened by the API code, and not closed. All of these items must be handled
before attempting to close the document.
Thrown if saveModified is 'true' and the PathName is not set yet.
Thrown if saveModified is 'true' and the saving target file is read only.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if this a linked file.

Autodesk.Revit.DB.Document.PlanTopologies(Autodesk.Revit.DB.Phase)
Gets the PlanTopologies of the current project in a given phase.
phase: The phase of the Plan Topology.
Remarks: Accessing plan topologies requires that document is modifiable as it will actually trigger calculating plan topologies if they have not been calculated yet.
The time necessary for the calculations may be significant and should be considered.

Autodesk.Revit.DB.Document.PlanTopologies
Gets the PlanTopologies of the current project.
Get the PlanTopologies of the current project in the last phase.
Remarks: Accessing plan topologies requires that document is modifiable as it will actually trigger calculating plan topologies if they have not been calculated yet.
The time necessary for the calculations may be significant and should be considered.

Autodesk.Revit.DB.Document.PlanTopology(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase)
Get the PlanTopology of a given level in a given phase.
level: The level of the Plan Topology.
phase: The phase of the Plan Topology.
Remarks: Accessing plan topology requires that document is modifiable as it will actually trigger calculating plan topology if they have not been calculated yet.
The time necessary for the calculations may be significant and should be considered.

Autodesk.Revit.DB.Document.PlanTopology(Autodesk.Revit.DB.Level)
Gets the PlanTopology of a given level.
Get the PlanTopology of a given level in the last phase.
level: The level of the Plan Topology.
Remarks: Accessing plan topology requires that document is modifiable as it will actually trigger calculating plan topology if they have not been calculated yet.
The time necessary for the calculations may be significant and should be considered.

Autodesk.Revit.DB.Document.Print(Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.View,System.Boolean)
Prints a set of views with a specified view template and default print settings.
views: The set of views which need to be printed.
viewTemplate: The view template which apply to the set of views.
useCurrentPrintSettings: If true, print the view with the current print setting,
otherwise with the print setting of the document of the view.
Remarks: If one view in the set can not be printed successfully then an exception will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when printing is not allowed in the current application mode.
Or when at least one view from the view set is not a printable view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the view set to be printed is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the view set contains a null element.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown when at least one view from the view set could not be printed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when print is cancelled by event handler.

Autodesk.Revit.DB.Document.Print(Autodesk.Revit.DB.ViewSet,Autodesk.Revit.DB.View)
Prints a set of views with a specified view template and default print settings.
views: The set of views which need to be printed.
viewTemplate: The view template which apply to the set of views.
Remarks: If one view in the set can not be printed successfully then an exception will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when printing is not allowed in the current application mode.
Or when at least one view from the view set is not a printable view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the view set to be printed is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the view set contains a null element.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown when at least one view from the view set could not be printed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when print is cancelled by event handler.

Autodesk.Revit.DB.Document.Print(Autodesk.Revit.DB.ViewSet,System.Boolean)
Prints a set of views with default view template and default print settings.
views: The set of views which need to be printed.
useCurrentPrintSettings: If true, print the view with the current print setting,
otherwise with the print setting of the document of the view.
Remarks: If one view in the set can not be printed successfully then an exception will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when printing is not allowed in the current application mode.
Or when at least one view from the view set is not a printable view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the view set to be printed is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the view set contains a null element.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown when at least one view from the view set could not be printed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when print is cancelled by event handler.

Autodesk.Revit.DB.Document.Print(Autodesk.Revit.DB.ViewSet)
Prints a set of views.
Prints a set of views with default view template and default print settings.
views: The set of views which need to be printed.
Remarks: If one view in the set can not be printed successfully then an exception will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when printing is not allowed in the current application mode.
Or when at least one view from the view set is not a printable view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the view set to be printed is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the view set contains a null element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when at least one view from the view set could not be printed.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when print is cancelled by event handler.

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String,Autodesk.Revit.DB.IFamilyLoadOptions,Autodesk.Revit.DB.FamilySymbol@)
Loads only the specified family type/symbol from a family file into the document and
provides a reference to the loaded family symbol.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
familyLoadOptions: The interface implementation to use when loading a family into the document.
symbol: A reference to the family symbol that was loaded if successful, otherwise Nothing.
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.
Since: 2011

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String,Autodesk.Revit.DB.FamilySymbol@)
Loads only the specified family type/symbol from a family file into the document and
provides a reference to the loaded family symbol.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
symbol: A reference to the family symbol that was loaded if successful, otherwise null.
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.

Autodesk.Revit.DB.Document.LoadFamilySymbol(System.String,System.String)
Loads only a specified family type/symbol from a family file into the document.
Loads only a specified family type/symbol from a family file into the document.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
name: The name of the type/symbol to be loaded, such as "W11x14".
Returns: True if the family type/symbol was loaded successfully into the project, otherwise False.
Remarks: This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename or name is null or empty.

Autodesk.Revit.DB.Document.EditFamily(Autodesk.Revit.DB.Family)
Gets the document of a loaded family to edit.
loadedFamily: The loaded family in current document.
Returns: Reference of the document of the family.
Remarks: This creates an independent copy of the family for editing.
To apply the changes back to the family stored in the document, use the LoadFamily overload
accepting Autodesk.Revit.DB.IFamilyLoadOptions.
This method may not be called if the document is currently modifiable (has an open transaction)
or is in a read-only state. The method may not be called during dynamic updates. To test the
document's current status, check the values of IsModifiable and IsReadOnly properties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"loadedFamily"-is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input argument-"loadedFamily"-is an in-place family or a non-editable family.
(This can be checked with the IsInPlace and IsEditable properties of the Family class.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the family is already being edited.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Thrown if this method is called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this method is called while the document is modifiable (i.e. it has an unfinished transaction.)
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this method is currently in a read-only state.

Autodesk.Revit.DB.Document.LoadFamily(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.IFamilyLoadOptions)
Loads the contents of this family document into another document.
targetDocument: The target document which the family will be loaded into.
familyLoadOptions: The interface implementation to use when responding to conflicts during the load operation.
Returns: Reference of the family in the target document.
Remarks: If you are reloading an edited family back into the source document from which it was extracted, use this overload.
This is because this overload allows you to respond to possible conflicts due to families already being present in the target document.
The Revit API offers one automatic overload: RevitUIFamilyLoadOptions, which will show the same prompts to the user as seen during an
interactive load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"targetDocument" or "familyLoadOptions"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not a family document,
or when the target document is modifiable (e.g. there is an uncommitted transaction) or doesn't support load of this kind of families (e.g. loading a model family to detail family is disallowed),
or the load was cancelled due to a conflict and a False return from one of the interface methods,
or this document is currently in a read-only state.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Thrown if this method is called during dynamic update.

Autodesk.Revit.DB.Document.LoadFamily(Autodesk.Revit.DB.Document)
Loads the contents of this family document into another document.
targetDocument: The target document where the family will be loaded.
Returns: Reference of the family in the target document.
Remarks: If you are reloading an edited family back into the source document from which it was extracted, this method will always fail.
This is because this method automatically suppresses the prompts Revit typically uses to deal with conflicts between families, and
assumes that any such conflict should prevent the loading.  If you want to be able to reload the same family into the source document,
you should use the LoadFamily() overload accepting Autodesk.Revit.DB.IFamilyLoadOptions.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument-"targetDocument"-is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the current document is not a family document,
or when the target document is modifiable (e.g. there is an uncommitted transaction) or doesn't support load of this kind of families (e.g. loading a model family to detail family is disallowed),
or when this family was found in the target document already and the conflict caused an automatic abort of the load operation,
or when a shared family in this family was found in the target document already
and the conflict caused an automatic abort of the load operation,
or this document is currently in a read-only state.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
Thrown if this method is called during dynamic update.

Autodesk.Revit.DB.Document.LoadFamily(System.String,Autodesk.Revit.DB.IFamilyLoadOptions,Autodesk.Revit.DB.Family@)
Loads an entire family and all its types/symbols into the document and provides a reference
to the loaded family.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
familyLoadOptions: The interface implementation to use when loading a family into the document.
family: A reference to the family that was loaded if successful, otherwise Nothing.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks:
Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use one of the LoadFamilySymbol() methods
and only load those symbols that you need.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument "familyLoadOptions" is null.
Since: 2011

Autodesk.Revit.DB.Document.LoadFamily(System.String,Autodesk.Revit.DB.Family@)
Loads an entire family and all its types/symbols into the document and provides a reference
to the loaded family.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
family: A reference to the family that was loaded if successful, otherwise null.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks:
Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use one of the LoadFamilySymbol() methods
and only load those symbols that you need.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.

Autodesk.Revit.DB.Document.LoadFamily(System.String)
Loads a family and all its types/symbols into the document.
Loads an entire family and all its types/symbols into the document.
filename: The fully qualified filename of the Family file, usually ending in .rfa.
Returns: True if the entire family was loaded successfully into the project, otherwise False.
Remarks:
Loading an entire family may take a considerable amount of time and memory. It is
recommended that you use one of the LoadFamilySymbol() methods
and only load those symbols that you need.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when filename is null or empty.

Autodesk.Revit.DB.Document.ProjectInformation
Returns: Autodesk::Revit::DB::ProjectInfo
Return the Project Information of the current project.

Autodesk.Revit.DB.Document.ReactionsAreUpToDate
Reports if the analytical model has regenerated in a document with reaction loads.
Remarks: Revit sets this property to False after regeneration of the analytical model if the document contains loads that have isReaction=True.
This results in a user-visible warning that exists until there are no longer loads with isReaction=True.

Autodesk.Revit.DB.Document.Phases
Retrieves all the object that represent phases within the project.
Remarks: The phases returned are in order of earliest phase first, through to latest phase last.

Autodesk.Revit.DB.Document.PanelTypes
Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the
project.
Remarks: This property returns a set of panelType objects. These objects can be used change the type of a panel from one type to another.

Autodesk.Revit.DB.Document.MullionTypes
This property is used to retrieve all the mullion types in current system.
Remarks: This property returns a set of MullionType objects. These objects can be used change the type of a mullion from one type to another.

Autodesk.Revit.DB.Document.ParameterBindings
Retrieves an object from which mappings between parameter definitions and categories can
be found.
Remarks: Returns a mapping between parameter definitions and parameter bindings. New bindings can
be added to the Revit Document by using this object.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: When the document is a family document.

Autodesk.Revit.DB.Document.DisplayUnitSystem
Provides access to display unit type with in the document.
Remarks: Return the display unit type, metric or imperial.

Autodesk.Revit.DB.Document.Settings
Provides access to general application settings, such as Categories.
Remarks: Returns an object that provides access to various settings within Autodesk Revit.
The Settings property returns an object that provides access to the categories within the Autodesk
Revit project.

Autodesk.Revit.DB.Document.TypeOfStorage(Autodesk.Revit.DB.BuiltInParameter)
Get the storage type of the specified BuiltInParameter.

Autodesk.Revit.DB.Document.GetHashCode
Gets the hash code of this document instance.
Remarks:
The hash code is the same for document instances that represent the same document currently opened in the Revit session.
The hash code is generated when a Revit file is opened or created in session.
If the same Revit file is opened later (in the same session or a different session) the hash code will not be the same.

Autodesk.Revit.DB.Document.Equals(System.Object)
Determines whether the specified System.Object equals to this System.Object.
Remarks:
Two document instances are considered equal if they represent the same document currently opened in the Revit session.

Autodesk.Revit.DB.Document
An object that represents an open Autodesk Revit project.
Remarks:
The Document object represents an Autodesk Revit project. Revit can have multiple
projects open and multiple views to those projects. The active or top most view will be the
active project and hence the active document which is available from the Application object.